command = input("Введіть запит до чат-бота: ").lower()
if "привіт" in command or "добрий день" in command:
   print("Бот: Вітаю! Чим можу допомогти?")
elif "погода" in command:
    print("Бот: Сьогодні сонячно, температура +20°C.")
elif "час" in command or "годин" in command:
    print("Бот: На жаль, я не маю доступу до годинника вашої системи.")
elif "до побачення" in command or "бувай" in command:
    print("Бот: Хай щастить! Звертайтеся ще.")
else:
    print("Бот: Я не розумію вашого запиту. Спробуйте перефразувати.")